// static/js/mapping.js
export const nameMap={
    "楊":"よう","捕抓":"を捕まえる","范":"はん","玲":"れい","捕獲":"を捕獲した","吳":"ご","王":"おう","芝":"し","秀":"しゅう","孟":"もう","蓮":"れん","連":"れん","何":"か","婉":"えん","洪":"こう","慧":"けい","胸部":"おっぱい","美":"び","葡萄":"ぶどう","的":"の","芳":"ほう","帥":"すい","莉":"り","大奶":"デカパイ","鈺":"ぎょく","恩":"おん","奶子":"おっぱい","喬":"きょう","靜":"せい","黎":"れい","李":"り","佳":"か","雅":"が","至":"し","林":"りん","劉":"りゅう","巨乳":"デカパイ","蘭":"らん","平":"へい","素":"そ","謝":"しゃ","涂":"と","巧":"こう","瑜":"ゆ","慈":"じ","瑩":"えい","芬":"ふん","母":"お母さん","依":"い","周":"しゅう","蓓":"ばい","張":"ちょう","黃":"こう","阿姨":"おばさん","桂":"けい","涵":"かん","蒼":"そう","夫人":"奧様","庭":"てい","幽":"ゆう","妍":"けん","山":"さん","爺":"や","吟":"ぎん","邱":"きゅう","菁":"せい","許":"きょ","烏":"ふ","容":"よう","玲":"れい","巧":"こう","莉":"り",
    "奶奶": "ＡＶＩＡ","媽媽": "ＭＡＴＥＲ","女兒": "ＦＩＬＩＡ","病患": "ＡＥＧＲＡ","人偶": "ＰＵＰＡ","母狗": "ＣＡＮＩＣＵＬＡ","聖誕老人": "ＳＡＮＣＴＡ　ＮＩＣＯＬＡＡ","食客": "ＣＯＮＶＩＶＡ","陰道": "ＶＡＧＩＮＡ","陰蒂": "ＣＬＩＴＯＲＩＳ","肉棒": "ＰＨＡＬＬＵＳ","下體": "ＭＥＭＢＲＵＭ","乳房": "ＵＢＥＲＡ"
};

const keys = Object.keys(nameMap).sort((a,b) => b.length - a.length);
export const searchRegex = new RegExp(keys.join('|'), 'g');